CREATE DATABASE  IF NOT EXISTS `petpei` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `petpei`;
-- MySQL dump 10.13  Distrib 8.0.26, for Win64 (x86_64)
--
-- Host: localhost    Database: petpei
-- ------------------------------------------------------
-- Server version	8.0.26

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `township_list`
--

DROP TABLE IF EXISTS `township_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `township_list` (
  `township_id` int NOT NULL AUTO_INCREMENT,
  `township_name` varchar(20) NOT NULL,
  `county_id` int NOT NULL,
  PRIMARY KEY (`township_id`),
  KEY `township_list_county_list_FK` (`county_id`),
  CONSTRAINT `township_list_county_list_FK` FOREIGN KEY (`county_id`) REFERENCES `county_list` (`county_id`)
) ENGINE=InnoDB AUTO_INCREMENT=371 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `township_list`
--

LOCK TABLES `township_list` WRITE;
/*!40000 ALTER TABLE `township_list` DISABLE KEYS */;
INSERT INTO `township_list` VALUES (1,'中正區',1),(2,'大同區',1),(3,'中山區',1),(4,'松山區',1),(5,'大安區',1),(6,'萬華區',1),(7,'信義區',1),(8,'士林區',1),(9,'北投區',1),(10,'內湖區',1),(11,'南港區',1),(12,'文山區',1),(13,'仁愛區',2),(14,'信義區',2),(15,'中正區',2),(16,'中山區',2),(17,'安樂區',2),(18,'暖暖區',2),(19,'七堵區',2),(20,'萬里區',3),(21,'金山區',3),(22,'板橋區',3),(23,'汐止區',3),(24,'深坑區',3),(25,'石碇區',3),(26,'瑞芳區',3),(27,'平溪區',3),(28,'雙溪區',3),(29,'貢寮區',3),(30,'新店區',3),(31,'坪林區',3),(32,'烏來區',3),(33,'永和區',3),(34,'中和區',3),(35,'土城區',3),(36,'三峽區',3),(37,'樹林區',3),(38,'鶯歌區',3),(39,'三重區',3),(40,'新莊區',3),(41,'泰山區',3),(42,'林口區',3),(43,'蘆洲區',3),(44,'五股區',3),(45,'八里區',3),(46,'淡水區',3),(47,'三芝區',3),(48,'石門區',3),(49,'宜蘭',4),(50,'頭城',4),(51,'礁溪',4),(52,'壯圍',4),(53,'員山',4),(54,'羅東',4),(55,'三星',4),(56,'大同',4),(57,'五結',4),(58,'冬山',4),(59,'蘇澳',4),(60,'南澳',4),(61,'東區',5),(62,'北區',5),(63,'香山區',5),(64,'竹北',6),(65,'湖口',6),(66,'新豐',6),(67,'新埔',6),(68,'關西',6),(69,'芎林',6),(70,'寶山',6),(71,'竹東',6),(72,'五峰',6),(73,'橫山',6),(74,'尖石',6),(75,'北埔',6),(76,'峨嵋',6),(77,'中壢',7),(78,'平鎮',7),(79,'龍潭',7),(80,'楊梅',7),(81,'新屋',7),(82,'觀音',7),(83,'桃園',7),(84,'龜山',7),(85,'八德',7),(86,'大溪',7),(87,'復興',7),(88,'大園',7),(89,'蘆竹',8),(90,'竹南',8),(91,'頭份',8),(92,'三灣',8),(93,'南庄',8),(94,'獅潭',8),(95,'後龍',8),(96,'通霄',8),(97,'苑裡',8),(98,'苗栗',8),(99,'造橋',8),(100,'頭屋',8),(101,'公館',8),(102,'大湖',8),(103,'泰安',8),(104,'銅鑼',8),(105,'三義',8),(106,'西湖',8),(107,'卓蘭',8),(108,'中區',9),(109,'東區',9),(110,'南區',9),(111,'西區',9),(112,'北區',9),(113,'北屯區',9),(114,'西屯區',9),(115,'南屯區',9),(116,'太平區',9),(117,'大里區',9),(118,'霧峰區',9),(119,'烏日區',9),(120,'豐原區',9),(121,'后里區',9),(122,'石岡區',9),(123,'東勢區',9),(124,'和平區',9),(125,'新社區',9),(126,'潭子區',9),(127,'大雅區',9),(128,'神岡區',9),(129,'大肚區',9),(130,'沙鹿區',9),(131,'龍井區',9),(132,'梧棲區',9),(133,'清水區',9),(134,'大甲區',9),(135,'外埔區',9),(136,'大安區',9),(137,'彰化',10),(138,'芬園',10),(139,'花壇',10),(140,'秀水',10),(141,'鹿港',10),(142,'福興',10),(143,'線西',10),(144,'和美',10),(145,'伸港',10),(146,'員林',10),(147,'社頭',10),(148,'永靖',10),(149,'埔心',10),(150,'溪湖',10),(151,'大村',10),(152,'埔鹽',10),(153,'田中',10),(154,'北斗',10),(155,'田尾',10),(156,'埤頭',10),(157,'溪州',10),(158,'竹塘',10),(159,'二林',10),(160,'大城',10),(161,'芳苑',10),(162,'二水',10),(163,'南投',11),(164,'中寮',11),(165,'草屯',11),(166,'國姓',11),(167,'埔里',11),(168,'仁愛',11),(169,'名間',11),(170,'集集',11),(171,'水里',11),(172,'魚池',11),(173,'信義',11),(174,'竹山',11),(175,'鹿谷',11),(176,'嘉義市',12),(177,'梅山',13),(178,'竹崎',13),(179,'阿里山',13),(180,'中埔',13),(181,'大埔',13),(182,'水上',13),(183,'鹿草',13),(184,'太保',13),(185,'朴子',13),(186,'東石',13),(187,'六腳',13),(188,'新港',13),(189,'民雄',13),(190,'大林',13),(191,'溪口',13),(192,'義竹',13),(193,'布袋',13),(194,'斗南',14),(195,'大埤',14),(196,'虎尾',14),(197,'土庫',14),(198,'褒忠',14),(199,'東勢',14),(200,'臺西',14),(201,'崙背',14),(202,'麥寮',14),(203,'斗六',14),(204,'林內',14),(205,'古坑',14),(206,'莿桐',14),(207,'西螺',14),(208,'二崙',14),(209,'北港',14),(210,'水林',14),(211,'口湖',14),(212,'四湖',14),(213,'元長',14),(214,'中區',15),(215,'東區',15),(216,'南區',15),(217,'西區',15),(218,'北區',15),(219,'安平區',15),(220,'安南區',15),(221,'永康區',15),(222,'歸仁區',15),(223,'新化區',15),(224,'左鎮區',15),(225,'玉井區',15),(226,'楠西區',15),(227,'南化區',15),(228,'仁德區',15),(229,'關廟區',15),(230,'龍崎區',15),(231,'官田區',15),(232,'麻豆區',15),(233,'佳里區',15),(234,'西港區',15),(235,'七股區',15),(236,'將軍區',15),(237,'學甲區',15),(238,'北門區',15),(239,'新營區',15),(240,'後壁區',15),(241,'白河區',15),(242,'東山區',15),(243,'六甲區',15),(244,'下營區',15),(245,'柳營區',15),(246,'鹽水區',15),(247,'善化區',15),(248,'大內區',15),(249,'山上區',15),(250,'新市區',15),(251,'安定區',15),(252,'新興區',16),(253,'前金區',16),(254,'芩雅區',16),(255,'鹽埕區',16),(256,'鼓山區',16),(257,'旗津區',16),(258,'前鎮區',16),(259,'三民區',16),(260,'楠梓區',16),(261,'小港區',16),(262,'左營區',16),(263,'仁武區',16),(264,'大社區',16),(265,'岡山區',16),(266,'路竹區',16),(267,'阿蓮區',16),(268,'田寮區',16),(269,'燕巢區',16),(270,'橋頭區',16),(271,'梓官區',16),(272,'彌陀區',16),(273,'永安區',16),(274,'湖內區',16),(275,'鳳山區',16),(276,'大寮區',16),(277,'林園區',16),(278,'鳥松區',16),(279,'大樹區',16),(280,'旗山區',16),(281,'美濃區',16),(282,'六龜區',16),(283,'內門區',16),(284,'杉林區',16),(285,'甲仙區',16),(286,'桃源區',16),(287,'三民區',16),(288,'茂林',16),(289,'茄萣',16),(290,'馬公',17),(291,'西嶼',17),(292,'望安',17),(293,'七美',17),(294,'白沙',17),(295,'湖西',17),(296,'屏東',18),(297,'三地門',18),(298,'霧臺',18),(299,'瑪家',18),(300,'九如',18),(301,'里港',18),(302,'高樹',18),(303,'盬埔',18),(304,'長治',18),(305,'麟洛',18),(306,'竹田',18),(307,'內埔',18),(308,'萬丹',18),(309,'潮州',18),(310,'泰武',18),(311,'來義',18),(312,'萬巒',18),(313,'崁頂',18),(314,'新埤',18),(315,'南州',18),(316,'林邊',18),(317,'東港',18),(318,'琉球',18),(319,'佳冬',18),(320,'新園',18),(321,'枋寮',18),(322,'枋山',18),(323,'春日',18),(324,'獅子',18),(325,'車城',18),(326,'牡丹',18),(327,'恆春',18),(328,'滿州',18),(329,'臺東',19),(330,'綠島',19),(331,'蘭嶼',19),(332,'延平',19),(333,'卑南',19),(334,'鹿野',19),(335,'關山',19),(336,'海端',19),(337,'池上',19),(338,'東河',19),(339,'成功',19),(340,'長濱',19),(341,'太麻里',19),(342,'金峰',19),(343,'大武',19),(344,'達仁',19),(345,'花蓮',20),(346,'新城',20),(347,'秀林',20),(348,'吉安',20),(349,'壽豐',20),(350,'鳳林',20),(351,'光復',20),(352,'豐濱',20),(353,'瑞穗',20),(354,'萬榮',20),(355,'玉里',20),(356,'卓溪',20),(357,'富里',20),(358,'金沙',21),(359,'金湖',21),(360,'金寧',21),(361,'金城',21),(362,'烈嶼',21),(363,'烏坵',21),(364,'南竿',22),(365,'北竿',22),(366,'莒光',22),(367,'東引',22),(368,'東沙',23),(369,'南沙',23),(370,'釣魚台列嶼',24);
/*!40000 ALTER TABLE `township_list` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-07-31 22:40:42
